# Set - множества. Множества содержат в себе только уникальные значения. Они удаляют повторяющиеся значения,
# оставляя только уникальные.
# set1 = [1, 2, 3, 4, 5, 5, 5, 6, 7]
# print(set1)
# set1 = set(set1)
# print(set1)

# Method add добавляет элемент во множество
# set1 = {1, 2, 3, 3, 3, 4, 5, 6}
# print(set1)
# print(type(set1))
# set1.add(9)
# print(set1)

# Method remove удаляет какой-либо элемент
# set1 = {1, 2, 3, 3, 3, 4, 5, 6}
# set1.remove(1)
# print(set1)

# Method discard удаляет какой-либо элемент
# set1 = {1, 2, 3, 3, 3, 4, 5, 6}
# set1.discard(1)
# print(set1)

# Method pop удаляет первый элемент с учетом сортировки данных (н-р в цифрах по возрастанию)
# set1 = {1, 2, 3, 3, 3, 4, 5, 6}
# print(set1)
# set1.pop()
# print(set1)